const { Markup } = require('telegraf');

// Обработчик команды /правила
async function rulesHandler(ctx) {
  try {
    // Проверяем, что команда используется только в публичном чате
    if (ctx.chat.type !== 'group' && ctx.chat.type !== 'supergroup') {
      return; // Просто выходим из функции без ответа
    }

    // Текст с новыми правилами
    const rulesText = `
📄 Правила для ЧАТА! 

• ЗАПРЕЩАЕТСЯ • 

▫️Оск.родни\упом родни! 
📛Наказание: мут 48 часов! 

▫️Оск. участников чата!
📛Наказание: мут 6 часов! 
❕ Наказание выдается в случае жалобы в " репорт " бота, от оскорбленного! 

▫️Оск.администраци чата! 
📛Наказание: мут 6 часов! 

▫️ Оск. наций!
📛Наказание: мут 12 часов!
❕ Наказание выдается в случае жалобы в " репорт " бота, от оскорбленного! 

▫️ 18+\политика\нацизм\экстремизм
📛Наказание: мут 48 часов! 

▫️ Спам\флуд 
📛Наказание: мут 2 часа! 

▫️ Реклама\пиар 
📛Наказание: мут 72 часа! 

▫️ Выдача себя за администрацию
📛Наказание: мут 42 часа! 

▫️ Слив личной информации\распространение фейк информации 
📛Наказание: мут от 24ч до 24О часов
 ( по решению администрации ) 
❕ Наказание выдается в случае жалобы в " репорт " бота, от оскорбленного! 

▫️ Провокации\угрозы
📛Наказание: мут от 12ч до 12Оч
( по решению администрации ) 
❕ Наказание выдается в случае жалобы в " репорт " бота, от оскорбленного! 

• ВАЖНО •
1. Правила могут обновляться, без предупреждения! 
2. При повторных нарушений, может быть выдан бан в ЧАТЕ!
3. некоторые правила, могут пересекаться с правилами в нашем боте, тем самым, вам могут выдать бан и в нем! ( Правила бота, прописаны в соглашении, с которым вы соглашались, при регистрации! )

❔В случае вопросов, обращаться в " репорт " в лс бота!
`;

    // Отправляем текст с правилами
    await ctx.replyWithHTML(rulesText);
  } catch (error) {
    console.error('Ошибка при выполнении команды /правила:', error);
    await ctx.reply('Произошла ошибка. Попробуйте позже.');
  }
}


// Функция для обработки команды "сотрудничество"
async function handlePartnershipCommand(ctx) {
  try {
      const message = `
🌟 <b>Сотрудничество с каналами</b>

Есть свой телеграмм канал по раздачам валюты нашего бота? Тогда мы готовы поддержать твой канал, но есть пару условий:

• В вашем канале должно быть <b>МИНИМУМ 20 подписчиков</b>
• В вашем канале должно быть <b>МИНИМУМ 3 фаста/конкурса на PF</b>
• В вашем канале <b>НЕ должно быть рекламы других ботов</b>

💼 <b>В случае партнерства, вы сможете получить:</b>
• Личные промо-коды для аудитории в вашем ТГ канале
• Выдача баланса (PF) для раздач в вашем канале
• Увеличение реферальных наград в 2 раза для ВАС
• Выдача эксклюзивных вещей для розыгрышей

🎩 Если заинтересовало, писать в лс @fbotcompitishen
      `;

      // Отправляем сообщение с информацией о сотрудничестве
      await ctx.replyWithHTML(message, {
          reply_markup: Markup.inlineKeyboard([
              Markup.button.url('💌 Написать в личные сообщения', 'https://t.me/fbotcompitishen ')
          ])
      });
  } catch (error) {
      console.error('Ошибка при выполнении команды "сотрудничество":', error);
      await ctx.reply('Произошла ошибка. Попробуйте позже.');
  }
}

module.exports = {
  rulesHandler,
  handlePartnershipCommand
};

