const { Markup } = require('telegraf');
const { getAllUsers, getUsersByStatuses, getUserStatuses } = require('../db'); // Импортируем необходимые функции
const { isModerator } = require('./muteManagement');
const { calculateLoadDetails } = require('../botMonitoring'); // Импортируем обновленную функцию

// Функция для создания клавиатуры админ-панели
function getAdminPanelKeyboard() {
  return Markup.inlineKeyboard([
    [Markup.button.callback('Список админов', 'list_admins')],
    [Markup.button.callback('Админские команды', 'admin_commands')],
    [Markup.button.callback('Закрыть', 'close_panel')],
  ]);
}

// Функция для проверки, является ли пользователь главным администратором
function isMainAdmin(userId) {
  return process.env.MAIN_ADMIN === userId.toString();
}

// Функция для проверки, является ли пользователь "Тех администратор"
async function isTechAdmin(userId) {
  const statuses = await getUserStatuses(userId); // Получаем статусы пользователя
  return statuses.includes('Тех администратор'); // Проверяем наличие статуса
}

// Функция для проверки, является ли пользователь "Администратор"
async function isRegularAdmin(userId) {
  const statuses = await getUserStatuses(userId); // Получаем статусы пользователя
  return statuses.includes('Администратор'); // Проверяем наличие статуса
}

// Функция для проверки, является ли пользователь администратором
async function isAdmin(userId) {
  return (
    isMainAdmin(userId) || // Проверка на главного администратора
    await isTechAdmin(userId) || // Проверка на "Тех администратор"
    await isRegularAdmin(userId) || // Проверка на обычного администратора
    await isModerator(userId) // Проверка на модератора
  );
}


// Функция для форматирования чисел с разделителями
function formatNumber(num) {
  return num.toString().replace(/\B(?=(\d{3})+(?!\d))/g, ' ');
}

// Функция для вывода админ-панели
async function showAdminPanel(ctx) {
  try {
      const userId = ctx.from.id.toString();
      
      // Проверяем права администратора или модератора
      if (!(await isAdmin(userId))) {
          return ctx.reply('❌ У вас нет прав для использования админ-панели.');
      }
      
      // Получаем всех пользователей
      const users = await getAllUsers();
      
      // Исключаем админов из общего подсчета балансов
      // Предполагается, что numeric_id админов известны (например, 1, 2, 3)
      const adminNumericIds = [1, 2, 3]; // Список numeric_id админов
      
      const regularUsers = users.filter(user => !adminNumericIds.includes(user.numeric_id));
      
      const totalPlayers = regularUsers.length;
      const totalPF = regularUsers.reduce((sum, user) => sum + user.balance, 0);
      const totalDF = regularUsers.reduce((sum, user) => sum + (user.df_balance || 0), 0);
      const totalCardBalance = regularUsers.reduce((sum, user) => sum + (user.card_balance || 0), 0);
      
      // Форматируем числа
      const formattedTotalPF = formatNumber(totalPF);
      const formattedTotalDF = formatNumber(totalDF);
      const formattedCardBalance = formatNumber(totalCardBalance);

      // Получаем подробную информацию о нагрузке
      const loadDetails = calculateLoadDetails();

      // Формируем сообщение для админ-панели
      const adminPanelMessage = `
📊 <b>Админ-панель</b> 📊

👥 Количество игроков: ${formatNumber(totalPlayers)}
 💰 Общий баланс PF: ${formattedTotalPF}
 💳 Общий баланс карт: ${formattedCardBalance}
 🍩 Общее количество DF: ${formattedTotalDF}

💻 <b>Нагрузка бота:</b>
 • RAM: ${loadDetails.memory}%
 • Общая: ${loadDetails.overall}%

Выберите действие:
`.trim();

      // Отправляем сообщение с клавиатурой
      await ctx.replyWithHTML(adminPanelMessage, getAdminPanelKeyboard());
      
  } catch (error) {
      console.error('Ошибка при выводе админ-панели:', error);
      await ctx.reply('Произошла ошибка при загрузке админ-панели.');
  }
}

// Обработчик кнопки "Список админов"
async function handleListAdmins(ctx) {
  try {
    const userId = ctx.from.id.toString();

    // Проверяем права администратора или модератора
    if (!(await isAdmin(userId))) {
      return ctx.answerCbQuery('У вас нет прав для выполнения этого действия.'); // Ответ на callback
    }

    // Получаем всех пользователей со статусами "Администратор", "Тех администратор" и "Модератор"
    const admins = await getUsersByStatuses(['Администратор', 'Тех администратор', 'Модератор']);

    if (admins.length === 0) {
      return ctx.reply('Список администраторов пуст.', { parse_mode: 'HTML' });
    }

    // Формируем список администраторов с гиперссылками и отметкой статусов
    const adminList = admins.map(admin => {
      const username = admin.username || `User${admin.numeric_id}`;
      const userLink = `<a href="tg://user?id=${admin.id}">${username}</a>`;
      const statusLabel = `(${admin.status_names})`;
      return `- ${userLink} ${statusLabel} (${admin.numeric_id})`;
    });

    // Объединяем все строки в один список
    const adminListMessage = `<b>Список администраторов:</b>\n${adminList.join('\n')}`;

    // Отправляем сообщение
    await ctx.replyWithHTML(adminListMessage);
  } catch (error) {
    console.error('Ошибка при получении списка администраторов:', error);
    await ctx.reply('Произошла ошибка при получении списка администраторов.');
  }
}

async function handleAdminCommands(ctx) {
  try {
    // Проверяем права администратора
    const userId = ctx.from.id.toString();
    if (!(await isAdmin(userId))) {
      return ctx.answerCbQuery('У вас нет прав для выполнения этого действия.'); // Ответ на callback
    }

    // Определяем роль пользователя
    const isTechAdminUser = await isTechAdmin(userId);
    const isRegularAdminUser = await isRegularAdmin(userId);
    const isModeratorUser = await isModerator(userId);

    // Формируем список команд для модератора
    const moderatorCommands = `
📄 <b>Список команд для модератора:</b>

🛡️ <b>Управление мутами:</b>
• Мут [id] [время в часах(по умолчанию)/мин] [причина](необязательно) - Замьютить пользователя
  ◦ Примеры использования:
    ▪ мут 12345 2 причина - Мут на 2 часа с причиной
    ▪ мут 12345 30 мин причина - Мут на 30 минут с причиной
    ▪ мут 12345 навсегда причина - Мут навсегда с причиной
    ▪ мут 12345 2 - Мут на 2 часа без причины
    ▪ мут 12345 30 мин - Мут на 30 минут без причины
    ▪ мут 12345 навсегда - Мут навсегда без указания причины
  ◦ При использовании ответом на сообщение:
    ▪ мут 2 причина - Мут пользователя, которому принадлежит сообщение, на 2 часа с причиной
    ▪ мут 30 мин причина - Мут пользователя, которому принадлежит сообщение, на 30 минут с причиной
    ▪ мут навсегда причина - Мут пользователя навсегда с причиной
    ▪ мут 2 - Мут пользователя на 2 часа без причины
    ▪ мут 30 мин - Мут пользователя на 30 минут без причины
    ▪ мут навсегда - Мут пользователя навсегда без указания причины
    ▪ мут - Мут пользователя навсегда без указания причины и времени
  Примечание: Время мута можно по умолчанию в часах, но можно указать и в минутах. Если указано слово "мин", время интерпретируется как минуты. Слово "часов" писать НЕ нужно.
• Размут [id] - Размьютить пользователя
  ◦ Примеры использования:
    ▪ размут 12345 - Снять мут с пользователя с id 12345
  ◦ При использовании ответом на сообщение:
    ▪ размут - Снять мут с пользователя, которому принадлежит сообщение
• Мутлист - Просмотреть список замьюченных пользователей
    `;

    // Формируем список команд для обычного администратора
    const adminCommands = `
📄 <b>Список команд для администратора:</b>

📣 <b>Управление репортами:</b>
• Список репортов - Просмотреть список неотвеченных репортов
• Ответить [номер_репорта] [текст_ответа] - Ответить на репорт

📛 <b>Управление черным списком:</b>
• Бан [id] [время в часах] или "навсегда" [причина] - Заблокировать пользователя
  ◦ Примеры использования:
    ▪ бан 12345 24 причина - Бан на 24 часа с причиной
    ▪ бан 12345 навсегда причина - Бан навсегда с причиной
    ▪ бан 12345 24 - Бан на 24 часа без причины
    ▪ бан 12345 навсегда - Бан навсегда без указания причины
  ◦ При использовании ответом на сообщение:
    ▪ бан 24 причина - Бан пользователя, которому принадлежит сообщение
    ▪ бан навсегда причина - Бан навсегда с причиной
    ▪ бан 24 - Бан на 24 часа без причины
    ▪ бан навсегда - Бан навсегда без указания причины
    ▪ бан - Бан навсегда без указания причины и времени
  Время бана указывается строго в часах либо словом "навсегда"
• Разбан [id] - Разблокировать пользователя
  ◦ Примеры использования:
    ▪ разбан 12345 - Снять бан с пользователя с id 12345
  ◦ При использовании ответом на сообщение:
    ▪ разбан - Снять бан с пользователя, которому принадлежит сообщение
• ЧС - Просмотреть список заблокированных пользователей

🎮 <b>Игровые привилегии:</b>

• <code>/id</code> либо <code>ид</code> [телеграм ид]/ответом на сообщение</code>
• <code>/prof</code> либо <code>гет</code> либо <code>чек</code> [id]/ответом на сообщение
    `;

    // Формируем список команд для технического администратора
    const techAdminCommands = `
⚙️ <b>Для технических админов:</b>

💰 <b>Управление профилем пользователей:</b>
• <code>Выдать пф [ID игрока] [число]</code> - Добавить PF пользователю
• <code>Забрать пф [ID игрока] [число]</code> - Удалить PF у пользователя
• <code>Все префиксы</code> - список всех существующих префиксов
• <code>Выдать префикс [ID игрока] [номер]</code> - Добавить префикс пользователю
• <code>Забрать префикс [ID игрока] [номер]</code> - Удалить префикс у пользователя

📛 <b>Управление черным списком:</b>
• <code>Бан [id] [время в часах] или "навсегда" [причина]</code> - Заблокировать пользователя
  ◦ Примеры использования:
    ▪ <code>бан 12345 24 причина</code> - Бан на 24 часа с причиной
    ▪ <code>бан 12345 навсегда причина</code> - Бан навсегда с причиной
    ▪ <code>бан 12345 24</code> - Бан на 24 часа без причины
    ▪ <code>бан 12345 навсегда</code> - Бан навсегда без указания причины
  ◦ При использовании ответом на сообщение:
    ▪ <code>бан 24 причина</code> - Бан пользователя, которому принадлежит сообщение
    ▪ <code>бан навсегда причина</code> - Бан навсегда с причиной
    ▪ <code>бан 24</code> - Бан на 24 часа без причины
    ▪ <code>бан навсегда</code> - Бан навсегда без указания причины
    ▪ <code>бан</code> - Бан навсегда без указания причины и времени
  Время бана указывается строго в часах либо словом "навсегда"
• <code>Разбан [id]</code> - Разблокировать пользователя
  ◦ Примеры использования:
    ▪ <code>разбан 12345</code> - Снять бан с пользователя с id 12345
  ◦ При использовании ответом на сообщение:
    ▪ <code>разбан</code> - Снять бан с пользователя, которому принадлежит сообщение
• <code>ЧС</code> - Просмотреть список заблокированных пользователей

🛡️ <b>Управление мутами:</b>
• <code>Мут [id] [время в часах(по умолчанию)/мин] [причина](необязательно)</code> - Замьютить пользователя
  ◦ Примеры использования:
    ▪ <code>мут 12345 2 причина</code> - Мут на 2 часа с причиной
    ▪ <code>мут 12345 30 мин причина</code> - Мут на 30 минут с причиной
    ▪ <code>мут 12345 навсегда причина</code> - Мут навсегда с причиной
    ▪ <code>мут 12345 2</code> - Мут на 2 часа без причины
    ▪ <code>мут 12345 30 мин</code> - Мут на 30 минут без причины
    ▪ <code>мут 12345 навсегда</code> - Мут навсегда без указания причины
  ◦ При использовании ответом на сообщение:
    ▪ <code>мут 2 причина</code> - Мут пользователя, которому принадлежит сообщение, на 2 часа с причиной
    ▪ <code>мут 30 мин причина</code> - Мут пользователя, которому принадлежит сообщение, на 30 минут с причиной
    ▪ <code>мут навсегда причина</code> - Мут пользователя навсегда с причиной
    ▪ <code>мут 2</code> - Мут пользователя на 2 часа без причины
    ▪ <code>мут 30 мин</code> - Мут пользователя на 30 минут без причины
    ▪ <code>мут навсегда</code> - Мут пользователя навсегда без указания причины
    ▪ <code>мут</code> - Мут пользователя навсегда без указания причины и времени
  Примечание: Время мута можно по умолчанию в часах, но можно указать и в минутах. Если указано слово "мин", время интерпретируется как минуты. Слово "часов" писать НЕ нужно.
• <code>Размут [id]</code> - Размьютить пользователя
  ◦ Примеры использования:
    ▪ <code>размут 12345</code> - Снять мут с пользователя с id 12345
  ◦ При использовании ответом на сообщение:
    ▪ <code>размут</code> - Снять мут с пользователя, которому принадлежит сообщение
• <code>Мутлист</code> - Просмотреть список замьюченных пользователей
🎟 <b>Управление промокодами:</b>
• <code>Создать [количество] [название] [тип] [число]</code> - Создать новый промокод
• <code>Удалить промо [ID промокода]</code> - Удалить существующий промокод
• <code>Список промо</code> - Просмотреть список всех промокодов

📧 <b>Управление рассылками:</b>
• <code>Рассылка текст [текст]</code> - Отправить текстовую рассылку всем пользователям
• Рассылка цитата - Отправить цитату всем пользователям
  ◦ Для отправки цитаты необходимо ответить на сообщение в чате
  ◦ Доступные варианты:
    ▪ <code>Рассылка цитата</code> - Переслать сообщение с указанием автора
    ▪ Рассылка цитата - Отправить только текст сообщения без указания автора

💭 <b>Управление режимами чатов:</b>
• <code>Деактивировать дабл/дайс</code> - Деактивировать режим в чате
<b>Управление репортами:</b>
• <code>Список репортов</code> - Просмотреть список неотвеченных репортов
• <code>Ответить [номер_репорта] [текст_ответа]</code> - Ответить на репорт
<b>Управление статусами:</b>
• <code>Список статусов</code> - Просмотреть список всех статусов
• <code>Наградить [numeric_id] [id_статуса]</code> - Назначить статус пользователю
• <code>Разжаловать [numeric_id] [id_статуса]</code> - Забрать статус пользователя

👾 <b>Босс:</b>
• <code>новый_босс</code> - создать/сбросить босса
• <code>проверить_босстоп</code> - информация о топерах босса
• <code>топ_кулаков</code> - топ по прокачке
• <code>список_оружия</code> [id игрока] - выводит инфу о оружии игрока
• <code>снятьхп</code> [количество] - снимает здоровье у босса
• <code>дать_энергию</code> [id игрока] [количество]- дает энергию
• <code>забрать_энергию</code> [id игрока] [количество]- забирает энергию


👨‍⚖ <b>Аукцион:</b>
• <code>Новый_аукцион</code> [сумма минимальной ставки] [минимальный шаг перебития] [название лота]- начинает новый аук
• <code>Завершить_аукцион</code> - завершает аук
• <code>аук_инфо</code> - информация о ставках аукциона


⚙️ <b>Технические команды:</b>
• /delete [id_игрока] - удалить аккаунд игрока
• <code>/changeid [старый ид] [новый ид]</code> - заменить ид игрока на новый
• <code>/свободныеид</code> - список свободных ид
• <code>/id</code> либо <code>ид</code> [телеграм ид]/ответом на сообщение
• <code>/prof</code> либо <code>гет</code> либо <code>чек</code> [id]/ответом на сообщение
• <code>Размер</code> - Получить размер базы данных
• <code>Бэкап</code> - Создать и отправить резервную копию базы данных
• <code>Сменить_реф [id] [новая_сумма]</code>
• <code>Сменить_реф_бонус_30000</code> - меняет реф бонус на 10.000 PF всем игрокам бота  
• <code>Дать [id/telegram_id] [тип_предмета] [количество]</code> - выдать чтото
• <code>Забор [id/telegram_id] [тип_предмета] [количество]</code> - забрать чтото
• <code>Проверить_топ</code> - инфа о топерах
• <code>Проверить_рефтоп</code> - инфа о реф топерах
• <code>Проверить_конт</code> - инфа по держателям контейнеров
• <code>Проверить_карты</code> - инфа о балансах карт
• <code>Проверить_статусы</code> - инфа о статусниках
• <code>Проверить_акции</code> - инфа о топ 10 акционеров
• <code>Проверить_дф</code> - инфа о главных держателях DF
• <code>Чек_скин [название файла]</code> - выводит изображение по файлу
• <code>Выдать_скин [id игрока] [id скина]</code> - выдача скина игроку
• <code>Забрать_скин [id игрока] [id скина]</code> - отнятие скина у игрока
• <code>Блок_переводы [id игрока]</code> - блокировка переводов игроку
• <code>Разблок_переводы [id игрока]</code> -разблокировка переводов игроку
• <code>/reset [id игрока]</code> - обнуление аккаунта игрока с сохранением ид
• <code>Реф_вычесть [id игрока] [количество]</code> - вычитаем рефералы у игрока
• <code>Блок_топа [id игрока]</code> - Убирает отображение игрока в топе пф
• <code>Разблок_топа [id игрока]</code> - Возвращает отображение в топе пф
• <code>Объявление</code> [текст] - созвать всех в чате
• <code>Создать_префикс</code> [название] - создаёт специальный префикс
• <code>Выдать_спец_префикс</code> [id игрока] [id префикса] - выдаёт игроку спец префикс
• <code>Забрать_спец_префикс</code> [id игрока] [id префикса] - забирает у игрока спец префикс
• <code>Удалить_репорт</code> [id репорта] - удаляет репорт
• <code>Сменить_ник</code> [id игрока] [новый ник]- меняет ник игроку
• <code>смс</code> [id игрока] [текст]- отправляет приватное сообщение игроку

• <code>Проверить_скины</code> [id игрока]/без ид - выводит список скинов конкретного игрока/всех существующих скинов
• <code>новая_цена</code> [id скина] [новая_цена] - меняет цену скина

🍬 <b>Конфеты:</b>
• <code>выдать_конфеты</code> [id] [количество] - выдать конфеты
• <code>забрать_конфеты</code> [id] [количество] - забрать конфеты


`;
    // Отправляем соответствующий список команд
    let commandsMessage;
    if (isTechAdminUser) {
      commandsMessage = techAdminCommands;
    } else if (isRegularAdminUser) {
      commandsMessage = adminCommands;
    } else if (isModeratorUser) {
      commandsMessage = moderatorCommands;
    } else {
      return ctx.reply('❌ У вас нет доступа к списку админских команд.');
    }

    // Максимальная длина сообщения в Telegram
    const maxMessageLength = 4096;

    // Разбиваем сообщение на части, если оно слишком длинное
    for (let i = 0; i < commandsMessage.length; i += maxMessageLength) {
      const chunk = commandsMessage.slice(i, i + maxMessageLength);

      // Отправляем каждую часть как отдельное сообщение
      await ctx.replyWithHTML(chunk);
    }
  } catch (error) {
    console.error('Ошибка при выводе списка админских команд:', error);
    await ctx.reply('Произошла ошибка при получении списка админских команд.');
  }
}

// Обработчик кнопки "Закрыть"
async function handleClosePanel(ctx) {
  try {
    // Проверяем права администратора
    const userId = ctx.from.id.toString();
    if (!(await isAdmin(userId))) {
      return ctx.answerCbQuery('У вас нет прав для выполнения этого действия.'); // Ответ на callback
    }

    // Удаляем клавиатуру
    await ctx.editMessageReplyMarkup(undefined); // Убираем кнопки
    await ctx.reply('Админ-панель закрыта.');
  } catch (error) {
    console.error('Ошибка при закрытии админ-панели:', error);
    await ctx.reply('Произошла ошибка при закрытии админ-панели.');
  }
}

// Экспортируем функции
module.exports = {
  showAdminPanel,
  handleListAdmins,
  handleAdminCommands,
  handleClosePanel,
  isAdmin,
  isTechAdmin
};